src/Documents/РасчетСРуководителем/РасчетСРуководителем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетСРуководителем</name>
  <attributes>
    <name>Программа</name>
    <type>
      <types>CatalogRef.УчебныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>EnumRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтепеньРуководителя</name>
    <type>
      <types>EnumRef.УченыеСтепени</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </attributes>
  <attributes>
    <name>КафедраРуководителя</name>
    <type>
      <types>CatalogRef.СтруктурныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерОкладаРуководителя</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаЧасовРуководителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифРуководителя</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтудентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПрограммы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КВыплатеРуководителю</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано1Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано1</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано2Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано2</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано3Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано3</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ДолжностныеОклады/ДолжностныеОклады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДолжностныеОклады</name>
  <resources>
    <name>РазмерОклада</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>EnumRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УченаяСтепень</name>
    <type>
      <types>EnumRef.УченыеСтепени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/УчебныеПрограммы/УчебныеПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеПрограммы</name>
  <attributes>
    <name>ВидПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрограммыСокращенно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПрограммыСокращенно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отрасль</name>
    <type>
      <types>EnumRef.Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПрограммы</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСлушателей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУчебныхЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормыОбучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправленияПодготовки</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.НаправленияПодготовки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Преподаватели</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИТПрактик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтраслевойПартнер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Должность</name>
    <type>
      <types>EnumRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьШаблон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Степень</name>
    <type>
      <types>EnumRef.УченыеСтепени</types>
    </type>
  </attributes>
  <attributes>
    <name>СтепеньСокращенно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Звание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>К1</name>
    <type>
      <types>DefinedType.Коэффициенты</types>
    </type>
  </attributes>
  <attributes>
    <name>К2</name>
    <type>
      <types>DefinedType.Коэффициенты</types>
    </type>
  </attributes>
  <attributes>
    <name>К3</name>
    <type>
      <types>DefinedType.Коэффициенты</types>
    </type>
  </attributes>
  <attributes>
    <name>К4</name>
    <type>
      <types>DefinedType.Коэффициенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/РасчетСРуководителем/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрограммаПриИзменении(Элемент)

	ДанныеДляЗаполнения = ПолучитьДанныеРуководителяНаСервере(Объект.Программа);

	Объект.Руководитель = ДанныеДляЗаполнения.Руководитель;
	Объект.ДолжностьРуководителя = ДанныеДляЗаполнения.Должность;
	Объект.СтепеньРуководителя = ДанныеДляЗаполнения.Степень;
	Объект.КафедраРуководителя = ДанныеДляЗаполнения.Кафедра;
	Объект.РазмерОкладаРуководителя = ДанныеДляЗаполнения.РазмерОклада;
	Объект.ОбъемПрограммы = ДанныеДляЗаполнения.КоличествоУчебныхЧасов;
	Объект.КоличествоСтудентов = ДанныеДляЗаполнения.КоличествоСлушателей;

	НормаЧасовРуководителя = 850;
	КоэффициентРасчета = 10;
	ПроцентОплаты = 100;
	ПроцентПремии = 0.2;
	МаксимальнаяВыплатаРуководителю = 30000;

	Объект.НормаЧасовРуководителя = НормаЧасовРуководителя;
	Объект.ТарифРуководителя = (ДанныеДляЗаполнения.РазмерОклада / НормаЧасовРуководителя) * КоэффициентРасчета;
	КВыплате = (Объект.ТарифРуководителя * Объект.КоличествоСтудентов * Объект.ОбъемПрограммы)
		/ ПроцентОплаты * ПроцентПремии;
	Объект.КВыплатеРуководителю = ?(КВыплате > МаксимальнаяВыплатаРуководителю, МаксимальнаяВыплатаРуководителю, КВыплате);

КонецПроцедуры

&НаКлиенте
Процедура НормаЧасовРуководителяПриИзменении(Элемент)

	Если Объект.НормаЧасовРуководителя = 0 Тогда
		Возврат;
	КонецЕсли;

	КоэффициентРасчета = 10;
	ПроцентОплаты = 100;
	ПроцентПремии = 0.2;
	МаксимальнаяВыплатаРуководителю = 30000;

	Объект.ТарифРуководителя = (Объект.РазмерОкладаРуководителя / Объект.НормаЧасовРуководителя) * КоэффициентРасчета;
	КВыплате = (Объект.ТарифРуководителя * Объект.КоличествоСтудентов * Объект.ОбъемПрограммы)
		/ ПроцентОплаты * ПроцентПремии;
	Объект.КВыплатеРуководителю = ?(КВыплате > МаксимальнаяВыплатаРуководителю, МаксимальнаяВыплатаРуководителю, КВыплате);

КонецПроцедуры

&НаКлиенте
Процедура Согласовано1ПриИзменении(Элемент)

	Объект.Согласовано1Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано1);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано2ПриИзменении(Элемент)
	
	Объект.Согласовано2Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано2);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовано3ПриИзменении(Элемент)                                              
	
	Объект.Согласовано3Должность = ПолучитьШаблонДолжностиНаСервере(Объект.Согласовано3);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеРуководителяНаСервере(Знач Ссылка)

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
	               |	УчебныеПрограммы.РуководительПрограммы КАК РуководительПрограммы,
	               |	Сотрудники.Должность КАК Должность,
	               |	Сотрудники.Степень КАК Степень,
	               |	Сотрудники.Подразделение КАК Подразделение,
	               |	ДолжностныеОклады.РазмерОклада КАК РазмерОклада,
	               |	УчебныеПрограммы.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
	               |	УчебныеПрограммы.КоличествоСлушателей КАК КоличествоСлушателей
	               |ИЗ
	               |	Справочник.УчебныеПрограммы КАК УчебныеПрограммы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДолжностныеОклады КАК ДолжностныеОклады
	               |			ПО Сотрудники.Должность = ДолжностныеОклады.Должность
	               |				И Сотрудники.Степень = ДолжностныеОклады.УченаяСтепень
	               |		ПО УчебныеПрограммы.РуководительПрограммы = Сотрудники.Ссылка
	               |ГДЕ
	               |	УчебныеПрограммы.Ссылка = &Ссылка";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Руководитель", Выборка.РуководительПрограммы);
		ДанныеДляЗаполнения.Вставить("Должность", Выборка.Должность);
		ДанныеДляЗаполнения.Вставить("Степень", Выборка.Степень);
		ДанныеДляЗаполнения.Вставить("Кафедра", Выборка.Подразделение);
		ДанныеДляЗаполнения.Вставить("РазмерОклада", Выборка.РазмерОклада);
		ДанныеДляЗаполнения.Вставить("КоличествоУчебныхЧасов", Выборка.КоличествоУчебныхЧасов);
		ДанныеДляЗаполнения.Вставить("КоличествоСлушателей", Выборка.КоличествоСлушателей);
	Иначе
		ДанныеДляЗаполнения = Новый Структура();
		ДанныеДляЗаполнения.Вставить("Руководитель", Неопределено);
		ДанныеДляЗаполнения.Вставить("Должность", Неопределено);
		ДанныеДляЗаполнения.Вставить("Степень", Неопределено);
		ДанныеДляЗаполнения.Вставить("Кафедра", Неопределено);
		ДанныеДляЗаполнения.Вставить("РазмерОклада", 0);
		ДанныеДляЗаполнения.Вставить("КоличествоУчебныхЧасов", 0);
		ДанныеДляЗаполнения.Вставить("КоличествоСлушателей", 0);
	КонецЕсли;

	Возврат ДанныеДляЗаполнения;

КонецФункции

&НаСервере
Функция ПолучитьШаблонДолжностиНаСервере(Согласовано)
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("Ссылка", Согласовано);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.ДолжностьШаблон КАК ДолжностьШаблон
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДолжностьШаблон;  
    КонецЕсли;

КонецФункции

#КонецОбласти
